In [1]:
import pandas as pd
import numpy as np

In [2]:
s= pd.Series([1,2,3,-4,-5])

In [3]:
s

0    1
1    2
2    3
3   -4
4   -5
dtype: int64

In [10]:
s.sum()

-5

In [11]:
data = [['Ayush', 100],['Saru', 1000], ['Maan', 90]]

In [13]:
df= pd.DataFrame(data, columns=['Name', 'Marks'])

In [14]:
df

    Name  Marks
0  Ayush    100
1   Saru   1000
2   Maan     90

In [20]:
df=pd.DataFrame(index=['First', 'Second', 'Third'])

In [22]:
df= pd.DataFrame(data, columns=['Name', 'Marks'])

In [23]:
df

    Name  Marks
0  Ayush    100
1   Saru   1000
2   Maan     90

In [24]:
df.index= ['First','Second', 'Third']

In [25]:
df

         Name  Marks
First   Ayush    100
Second   Saru   1000
Third    Maan     90

In [26]:
dict1 ={
    "name": ['Ayush', 'Maan' ,'Sarveshwari'],
    "age":[10,20,10]
}

In [27]:
df2=pd.DataFrame(dict1, index=['Person1', 'Person2', 'Person3'])

In [28]:
df2

                name  age
Person1        Ayush   10
Person2         Maan   20
Person3  Sarveshwari   10

In [29]:
df3=pd.DataFrame(dict1, index=False) #does not work

TypeError: Index(...) must be called with a collection of some kind, False was passed

In [30]:
df4 = pd.DataFrame(np.random.rand(10,4))

In [31]:
df4

          0         1         2         3
0  0.866669  0.087549  0.137276  0.850605
1  0.015889  0.200046  0.310447  0.861125
2  0.101519  0.084843  0.566433  0.995643
3  0.198485  0.436529  0.725847  0.751190
4  0.090844  0.351179  0.113633  0.231265
5  0.524688  0.023323  0.749061  0.740586
6  0.022891  0.959848  0.691908  0.077421
7  0.239593  0.818633  0.960790  0.123142
8  0.960696  0.873145  0.634697  0.241578
9  0.546290  0.162262  0.786298  0.635297

In [35]:
dates = pd.date_range('20020210', periods=100)

In [36]:
df6= pd.DataFrame(np.random.rand(100,4),index= dates, columns=list('ABCD'))

In [37]:
df6

                   A         B         C         D
2002-02-10  0.359148  0.988803  0.456786  0.158476
2002-02-11  0.165763  0.336500  0.306435  0.913350
2002-02-12  0.488313  0.073551  0.044648  0.655333
2002-02-13  0.383459  0.910021  0.330167  0.545505
2002-02-14  0.131721  0.231140  0.799983  0.130900
...              ...       ...       ...       ...
2002-05-16  0.666034  0.377438  0.318091  0.578561
2002-05-17  0.308890  0.523553  0.036423  0.322092
2002-05-18  0.651175  0.964446  0.950114  0.300150
2002-05-19  0.495862  0.591365  0.313526  0.987929
2002-05-20  0.464180  0.532119  0.646117  0.300783

[100 rows x 4 columns]

In [39]:
df6.sort_index(axis=0, ascending=False)

                   A         B         C         D
2002-05-20  0.464180  0.532119  0.646117  0.300783
2002-05-19  0.495862  0.591365  0.313526  0.987929
2002-05-18  0.651175  0.964446  0.950114  0.300150
2002-05-17  0.308890  0.523553  0.036423  0.322092
2002-05-16  0.666034  0.377438  0.318091  0.578561
...              ...       ...       ...       ...
2002-02-14  0.131721  0.231140  0.799983  0.130900
2002-02-13  0.383459  0.910021  0.330167  0.545505
2002-02-12  0.488313  0.073551  0.044648  0.655333
2002-02-11  0.165763  0.336500  0.306435  0.913350
2002-02-10  0.359148  0.988803  0.456786  0.158476

[100 rows x 4 columns]

In [41]:
df6.sort_values(by='B')

                   A         B         C         D
2002-03-20  0.000460  0.005474  0.504930  0.330128
2002-03-01  0.417365  0.012711  0.778698  0.842428
2002-03-17  0.340600  0.025136  0.059088  0.967667
2002-03-27  0.654248  0.030673  0.158791  0.030967
2002-02-28  0.070293  0.039756  0.996142  0.389380
...              ...       ...       ...       ...
2002-05-18  0.651175  0.964446  0.950114  0.300150
2002-04-22  0.323312  0.972872  0.698058  0.346008
2002-03-13  0.798817  0.973351  0.369900  0.682250
2002-02-10  0.359148  0.988803  0.456786  0.158476
2002-05-14  0.034127  0.999131  0.833138  0.217863

[100 rows x 4 columns]

In [47]:
df6[0:3]

                   A         B         C         D
2002-02-10  0.359148  0.988803  0.456786  0.158476
2002-02-11  0.165763  0.336500  0.306435  0.913350
2002-02-12  0.488313  0.073551  0.044648  0.655333

In [49]:
df6.iloc[0]

A    0.359148
B    0.988803
C    0.456786
D    0.158476
Name: 2002-02-10 00:00:00, dtype: float64

In [51]:
df6.iloc[0,:2]

A    0.359148
B    0.988803
Name: 2002-02-10 00:00:00, dtype: float64

In [53]:
df6['A']

2002-02-10    0.359148
2002-02-11    0.165763
2002-02-12    0.488313
2002-02-13    0.383459
2002-02-14    0.131721
                ...
2002-05-16    0.666034
2002-05-17    0.308890
2002-05-18    0.651175
2002-05-19    0.495862
2002-05-20    0.464180
Freq: D, Name: A, Length: 100, dtype: float64

In [63]:
df6['A']<0.5

2002-02-10     True
2002-02-11     True
2002-02-12     True
2002-02-13     True
2002-02-14     True
              ...
2002-05-16    False
2002-05-17     True
2002-05-18    False
2002-05-19     True
2002-05-20     True
Freq: D, Name: A, Length: 100, dtype: bool

In [64]:
dict1 ={
    "Name":['Ayushman', 'Sagar', 'Shyam', 'Parv'],
    "Height":[168, 167, 168,170],
    "Qualification":['IAS', 'PHD', 'PHD','PHD']
}

In [65]:
df10= pd.DataFrame(dict1)

In [66]:
df10

       Name  Height Qualification
0  Ayushman     168           IAS
1     Sagar     167           PHD
2     Shyam     168           PHD
3      Parv     170           PHD

In [67]:
mylist =['Patna', 'Patna', 'Chennai', 'Jaipur']

In [68]:
df10['Address']=mylist

In [69]:
df10

       Name  Height Qualification  Address
0  Ayushman     168           IAS    Patna
1     Sagar     167           PHD    Patna
2     Shyam     168           PHD  Chennai
3      Parv     170           PHD   Jaipur

In [72]:
df10.insert(4,'College',['MIT', 'MIT','MIT', 'IIT'])

In [73]:
df10

       Name  Height Qualification  Address College
0  Ayushman     168           IAS    Patna     MIT
1     Sagar     167           PHD    Patna     MIT
2     Shyam     168           PHD  Chennai     MIT
3      Parv     170           PHD   Jaipur     IIT

In [74]:
newdf1 = pd.DataFrame({
    "Name": ['Ram','Diya','Chandan', 'James', 'Alice']
})

In [76]:
newdf2= pd.DataFrame({
    "Maths":[80, 90, 77.5, 87.5, 86.5],
    "Physics":[81, 94, 74.5, 83, 82.5],
    "Chemistry":[91.5, 86.5, 85.5,90.0, 91.0],
    "Biology":[82.5, 83.5, 84.5,85.0, 93.0]}
)

In [77]:
newdf1

      Name
0      Ram
1     Diya
2  Chandan
3    James
4    Alice

In [78]:
newdf2

   Maths  Physics  Chemistry  Biology
0   80.0     81.0       91.5     82.5
1   90.0     94.0       86.5     83.5
2   77.5     74.5       85.5     84.5
3   87.5     83.0       90.0     85.0
4   86.5     82.5       91.0     93.0

In [79]:
pd.concat(newdf1, newdf2, axis=1)

/tmp/ipykernel_960683/2659167616.py:1: FutureWarning: In a future version of pandas all arguments of concat except for the argument 'objs' will be keyword-only.
  pd.concat(newdf1, newdf2, axis=1)

TypeError: concat() got multiple values for argument 'axis'

In [80]:
newdf3= pd.concat([newdf1, newdf2], axis=1)

In [81]:
newdf3

      Name  Maths  Physics  Chemistry  Biology
0      Ram   80.0     81.0       91.5     82.5
1     Diya   90.0     94.0       86.5     83.5
2  Chandan   77.5     74.5       85.5     84.5
3    James   87.5     83.0       90.0     85.0
4    Alice   86.5     82.5       91.0     93.0

In [85]:
newdf3['Total']= newdf3.sum(axis=1) #ignore warning

/tmp/ipykernel_960683/4124398022.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  newdf3['Total']= newdf3.sum(axis=1)

In [86]:
newdf3

      Name  Maths  Physics  Chemistry  Biology  Total
0      Ram   80.0     81.0       91.5     82.5  335.0
1     Diya   90.0     94.0       86.5     83.5  354.0
2  Chandan   77.5     74.5       85.5     84.5  322.0
3    James   87.5     83.0       90.0     85.0  345.5
4    Alice   86.5     82.5       91.0     93.0  353.0

In [87]:
new_row= newdf3.mean(axis=0)

/tmp/ipykernel_960683/2922661572.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  new_row= newdf3.mean(axis=0)

In [88]:
newdf3= newdf3.append(new_row, ignore_index= True)

/tmp/ipykernel_960683/4046602396.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  newdf3= newdf3.append(new_row, ignore_index= True)

In [89]:
newdf3

      Name  Maths  Physics  Chemistry  Biology  Total
0      Ram   80.0     81.0       91.5     82.5  335.0
1     Diya   90.0     94.0       86.5     83.5  354.0
2  Chandan   77.5     74.5       85.5     84.5  322.0
3    James   87.5     83.0       90.0     85.0  345.5
4    Alice   86.5     82.5       91.0     93.0  353.0
5      NaN   84.3     83.0       88.9     85.7  341.9